app/controllers/users_controller.rb

UPDATE "users" SET "username" = ?, "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "newn edited"], ["email", "new@gmail.comedit"], ["password", "zhuNicali123"], ["updated_at", "2020-11-25 10:36:12.588789"], ["id", 16]]
---
  def update
    if @user.update(user_params)